src/tests/performance/artillery/baseline.yml
config:
  target: "http://localhost:1990"
  phases:
    - duration: 60
      arrivalRate: 100
  processor: "./artillery-helpers.cjs"
  http:
    requestTimeout: 5000
scenarios:
  - flow:
      - function: "loginAndInsert"
      - get:
          url: "/data"
          headers:
            Authorization: "Bearer {{ token }}"